# Data Cleaning and Preparation

1. Handling Missing Data

In [1]:
import pandas as pd
import numpy as np

In [2]:
string_data = pd.Series(['apple', 'artichoke', np.nan, 'avocado'])
string_data

0        apple
1    artichoke
2          NaN
3      avocado
dtype: object

In [3]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [4]:
string_data[0] = None
string_data

0         None
1    artichoke
2          NaN
3      avocado
dtype: object

In [5]:
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

For numeric data pandas uses the floating-point value NAN (Not a Number) to represent missing data
Python None value is also treated as NA (not available) in object arrays

1.1 Filtering Out Missing Data

In [6]:
data = pd.Series([1, np.nan, 3.5, np.nan, 7])
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [7]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [8]:
#Boolean indexing
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [9]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

With DataFrame dropna() by default drops any row containing a missing value

In [10]:
data = pd.DataFrame([[1, 6.5, 3], [1, np.nan, np.nan], [np.nan, np.nan, np.nan], [np.nan, 6.5, 3]])
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [11]:
cleaned = data.dropna()
cleaned

     0    1    2
0  1.0  6.5  3.0

In [12]:
#Passing how='all' will only drop rows that are all nan
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [13]:
#To drop a column pass axis=1
data[4] = np.nan
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [14]:
data.dropna(axis=1, how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

Exercise:
keep only rows containing a certain number of observations.
Use thresh argument

In [15]:
df = pd.DataFrame(np.random.randn(7,3))
df

          0         1         2
0 -0.156032 -1.414279 -0.588306
1  0.427917  1.702463  0.528624
2  0.231225  1.610933 -0.026357
3 -0.111705 -0.505393 -0.210973
4  3.143132  1.081802 -1.267130
5 -0.945981  0.422037  0.388842
6  0.252746  0.283648 -0.423042

In [16]:
df.iloc[:4,1] = np.nan
df.iloc[:2,2] = np.nan
df

          0         1         2
0 -0.156032       NaN       NaN
1  0.427917       NaN       NaN
2  0.231225       NaN -0.026357
3 -0.111705       NaN -0.210973
4  3.143132  1.081802 -1.267130
5 -0.945981  0.422037  0.388842
6  0.252746  0.283648 -0.423042

In [17]:
df.dropna()

          0         1         2
4  3.143132  1.081802 -1.267130
5 -0.945981  0.422037  0.388842
6  0.252746  0.283648 -0.423042

In [18]:
df.dropna(thresh=2)

          0         1         2
2  0.231225       NaN -0.026357
3 -0.111705       NaN -0.210973
4  3.143132  1.081802 -1.267130
5 -0.945981  0.422037  0.388842
6  0.252746  0.283648 -0.423042

In [20]:
df.dropna(thresh=1)

          0         1         2
0 -0.156032       NaN       NaN
1  0.427917       NaN       NaN
2  0.231225       NaN -0.026357
3 -0.111705       NaN -0.210973
4  3.143132  1.081802 -1.267130
5 -0.945981  0.422037  0.388842
6  0.252746  0.283648 -0.423042

In [21]:
df[7] = np.nan
df

          0         1         2   7
0 -0.156032       NaN       NaN NaN
1  0.427917       NaN       NaN NaN
2  0.231225       NaN -0.026357 NaN
3 -0.111705       NaN -0.210973 NaN
4  3.143132  1.081802 -1.267130 NaN
5 -0.945981  0.422037  0.388842 NaN
6  0.252746  0.283648 -0.423042 NaN

In [30]:
df.dropna(thresh=2)

          0         1         2   7
2  0.231225       NaN -0.026357 NaN
3 -0.111705       NaN -0.210973 NaN
4  3.143132  1.081802 -1.267130 NaN
5 -0.945981  0.422037  0.388842 NaN
6  0.252746  0.283648 -0.423042 NaN

Specify the minimum number of non-NA/null values that a row or column must have in order to be kept, rather than dropped. This parameter is particularly useful when you want to retain rows or columns that meet a minimum threshold of data completeness.

In [31]:
df.dropna(thresh=4)

Empty DataFrame
Columns: [0, 1, 2, 7]
Index: []

In [32]:
df.dropna(thresh=4, axis=1)

          0         2
0 -0.156032       NaN
1  0.427917       NaN
2  0.231225 -0.026357
3 -0.111705 -0.210973
4  3.143132 -1.267130
5 -0.945981  0.388842
6  0.252746 -0.423042

The axis parameter determines whether rows or columns are dropped. For axis=0 (default), rows are analyzed and dropped. For axis=1, columns are analyzed and dropped.

1.2 Filling In Missing Data

In [33]:
df

          0         1         2   7
0 -0.156032       NaN       NaN NaN
1  0.427917       NaN       NaN NaN
2  0.231225       NaN -0.026357 NaN
3 -0.111705       NaN -0.210973 NaN
4  3.143132  1.081802 -1.267130 NaN
5 -0.945981  0.422037  0.388842 NaN
6  0.252746  0.283648 -0.423042 NaN

In [34]:
# fillna method with a constant replaces missing values with that value
df.fillna(0)

          0         1         2    7
0 -0.156032  0.000000  0.000000  0.0
1  0.427917  0.000000  0.000000  0.0
2  0.231225  0.000000 -0.026357  0.0
3 -0.111705  0.000000 -0.210973  0.0
4  3.143132  1.081802 -1.267130  0.0
5 -0.945981  0.422037  0.388842  0.0
6  0.252746  0.283648 -0.423042  0.0

In [35]:
# fillna method with a dict, fill value for each column
df.fillna({1:0.5, 2:4.4})

          0         1         2   7
0 -0.156032  0.500000  4.400000 NaN
1  0.427917  0.500000  4.400000 NaN
2  0.231225  0.500000 -0.026357 NaN
3 -0.111705  0.500000 -0.210973 NaN
4  3.143132  1.081802 -1.267130 NaN
5 -0.945981  0.422037  0.388842 NaN
6  0.252746  0.283648 -0.423042 NaN

In [36]:
df

          0         1         2   7
0 -0.156032       NaN       NaN NaN
1  0.427917       NaN       NaN NaN
2  0.231225       NaN -0.026357 NaN
3 -0.111705       NaN -0.210973 NaN
4  3.143132  1.081802 -1.267130 NaN
5 -0.945981  0.422037  0.388842 NaN
6  0.252746  0.283648 -0.423042 NaN

In [37]:
# returns a new object but you can modify the existing object in-place 
df.fillna(0, inplace=True)

In [38]:
df

          0         1         2    7
0 -0.156032  0.000000  0.000000  0.0
1  0.427917  0.000000  0.000000  0.0
2  0.231225  0.000000 -0.026357  0.0
3 -0.111705  0.000000 -0.210973  0.0
4  3.143132  1.081802 -1.267130  0.0
5 -0.945981  0.422037  0.388842  0.0
6  0.252746  0.283648 -0.423042  0.0

np.random.randn function from numpy generates an array of specified shape and fills it with random flaots sampled from the universal normal (Gaussian) distribution of mean 0 and variance 1

In [39]:
df = pd.DataFrame(np.random.randn(6,3))
df

          0         1         2
0 -1.375325 -0.534699  2.298301
1  0.513493 -0.183575  0.512347
2  0.674389  0.928540  0.944546
3 -0.997995  0.596053 -1.422647
4 -2.434951  2.314012 -0.516243
5  1.225228 -0.255166  1.764474

In [40]:
df.iloc[2:,1] = np.nan
df.iloc[4:,2] = np.nan
df

          0         1         2
0 -1.375325 -0.534699  2.298301
1  0.513493 -0.183575  0.512347
2  0.674389       NaN  0.944546
3 -0.997995       NaN -1.422647
4 -2.434951       NaN       NaN
5  1.225228       NaN       NaN

In [41]:
df.fillna(method='ffill')

          0         1         2
0 -1.375325 -0.534699  2.298301
1  0.513493 -0.183575  0.512347
2  0.674389 -0.183575  0.944546
3 -0.997995 -0.183575 -1.422647
4 -2.434951 -0.183575 -1.422647
5  1.225228 -0.183575 -1.422647

ffill forward fill the missing values in the DataFrame or Series. It fills missing values (NaN's) with the last observed non-null value in the column or row.
The forward fill method does not create new data. 
It propagates the last valid (non-null) observation forward to the next null observation

In [42]:
# The default value for axis is 0 (columns), and axis=1 for row
df.fillna(method='ffill',axis=1)

          0         1         2
0 -1.375325 -0.534699  2.298301
1  0.513493 -0.183575  0.512347
2  0.674389  0.674389  0.944546
3 -0.997995 -0.997995 -1.422647
4 -2.434951 -2.434951 -2.434951
5  1.225228  1.225228  1.225228

limit forward or backward filling, maximum number of consecutive periods to fill

In [43]:
df.fillna(method='ffill', limit=2)

          0         1         2
0 -1.375325 -0.534699  2.298301
1  0.513493 -0.183575  0.512347
2  0.674389 -0.183575  0.944546
3 -0.997995 -0.183575 -1.422647
4 -2.434951       NaN -1.422647
5  1.225228       NaN -1.422647

In [44]:
#Exercise: Fill the missing values with mean or median
data = pd.Series([1, np.nan, 3.5, np.nan, 7])
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [45]:
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

2. Data Transformation

2.1 Removing Duplicates

In [46]:
data = pd.DataFrame({'k1':['one','two'] * 3 + ['two'],
                    'k2': [1, 1, 2, 3, 3, 4, 4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [47]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [48]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [49]:
data['v1'] = range(7)
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [50]:
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [51]:
# passing keep = 'last' will return the last one 
data.drop_duplicates(['k1','k2'], keep='last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

2.2 Transforming Data Using a Function or Mapping